upcompu/test/sdkconfig.defaults
# sdkconfig.defaults - společné nastavení pro Matter aplikaci

CONFIG_IDF_TARGET="esp32c6"

# Partition table s dostatkem místa pro Matter/Thread data
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"

# Velikost flash pameti - vetsina ESP32-C6 vyvojovych desek ma 8MB.
# Pokud ma tvoje deska jen 4MB, zmen na "4MB" (a preveř, ze se partitions.csv vejde).
CONFIG_ESPTOOLPY_FLASHSIZE_8MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="8MB"

# Zaklad Matter
CONFIG_ENABLE_MATTER_SERVER=y
CONFIG_ENABLE_CHIP_SHELL=n

# BLE pro commissioning (parovani pres QR kod / setup kod)
CONFIG_BT_ENABLED=y
CONFIG_BT_NIMBLE_ENABLED=y

# mbedTLS nastaveni doporucena Matter SDK
CONFIG_MBEDTLS_CERTIFICATE_BUNDLE=y
